import { TEXT_STYLE } from './styles';

const FreeMasterClassTab = () => (
  <div className={TEXT_STYLE}>
    <p style={{ textShadow: '0 0px 10px rgba(0, 0, 0, 1)' }}>
      Запрошуємо тебе на безкоштовний пробний майстер-клас з вокалу. Наш формат - це не просто “музичні заняття з репетитором”, а можливість відкрити свою душу та здібності, які далеко заховані за буденними справами та проблемами. <br />
      Тут ти зможеш на власному досвіді відчути всю свою унікальність та дізнатися, що робить тебе кращим за інших,
      адже у нас немає ніяких рамок для творчості та у нас кожен може стати героєм своєї історії. Ти зможеш спробувати унікальні методи та техніки, розроблені нашим викладачем, який є автором власної
      методики через яку пройшли вже більше 1000 учнів. <br />
      Після заняття ти отримаєш результати, які тебе здивують, і
      захочеш залишитися з нами ще надовго. <br />
      А ще майстер-клас з вокалу - це чудова можливість провести вечір з цікавими
      людьми або зі своєю парою, розважитися та відволіктися від буденних справ :)
    </p>
  </div>
);

export default FreeMasterClassTab;