import { TEXT_STYLE } from './styles';

const HowMasterClassWorksTab = () => (
  <div className={TEXT_STYLE}>
    <p style={{ textShadow: '0 0px 10px rgba(0, 0, 0, 1)' }}>
      Дві години натхнення, звуку й відкриттів — саме так можна описати наш формат! <br />
      На майстер-класах ми працюємо в невеликих групах (від 1 до 5 учасників), і в цьому є особлива магія. Адже саме в групі поступово зникає страх бути почутим — і починає звучати справжній голос. <br />
      ▸ Починаємо зі знайомства — щоб було затишно. <br />
      ▸ Далі – вправи, що допомагають розслабитися й розкритися. <br />
      ▸ Потім – практичні завдання на напрацювання вокальних навичок. <br />
      ▸ На завершення кожен учасник обирає улюблену пісню, яку ми розбираємо разом із викладачем.
      І, звісно, співаємо в мікрофон. <br />
      <br />
      <span className="font-bold">Чому це працює? <br /></span>
      Бо ми віримо в вокальну соціалізацію. Можна співати шикарно
      наодинці з викладачем, але так і не наважитись вийти на сцену. А ми створюємо простір, де стає не страшно
      бути собою, коли співаєш.
    </p>
  </div>
);

export default HowMasterClassWorksTab;