import { HEADING_STYLE, HEADING_STYLE_THIRD } from "@/components/ui/About/styles"

export const sections = [
  {
    heading: "Для кого підходить наш курс групових занять?",
    imageSrc: "/35.jpg",
    imageAlt: "Photo of the vocal teacher",
    imageClass: "h-85 object-cover mr-5 pt-5 pl-5",
    text: `- Для тих, хто хоче по декілька годин на тиждень весело проводити час в компанії цікавих людей; <br />
           - Для тих, кому подобається співати; <br />
           - Для тих, хто мріє побудувати вокальну кар’єру; <br />
           - Для тих, хто завжди мріяв співати, але вважав, що для цього потрібні особливі здібності (спойлер: це не так, потрібен лише хороший викладач, велике бажання та багато практики).`,
    imageFirst: true,
    extraClass: "",
    hasButton: false,
    marginTop: "mt-20",
    headingStyle: HEADING_STYLE,
  },
  {
    heading: "Про курс",
    imageSrc: "/8.jpg",
    imageAlt: "Photo of the vocal teacher",
    imageClass: "h-78 object-cover mt-5 w-90 ml-5",
    text: `На заняттях ми робимо вправи, які не тільки допоможуть вам заспівати, а і розслабитись та почати почувати себе комфортно.
           Наш викладач даватиме вам цікаві інтерактивні завдання, які виявлять ваш потенціал та подарують цікавість до процесу.
           У нас супер неформальна та дружня атмосфера, ми всі спілкуємося на ти. Більшість учнів стають нашими друзями на довгий час і це ще більше робить нашу академію комфортним місцем для людей, які до нас приходять :)`,
    imageFirst: true,
    inverted: true,
    extraClass: "",
    hasButton: true,
    buttonText: "Переглянути прайс",
    paddingBottom: "pb-5",
    headingStyle: HEADING_STYLE,
  },
  {
    heading: "Індивідуальні заняття",
    imageSrc: "/nikaind.jpg",
    imageAlt: "Photo of the girl with microphone",
    imageClass: "h-78 object-cover mt-5 w-90 ml-5 mr-5",
    text: `- Для тих, хто хоче по декілька годин на тиждень весело проводити час в компанії цікавих людей; <br />
           - Для тих, кому подобається співати; <br />
           - Для тих, хто мріє побудувати вокальну кар’єру; <br />
           - Для тих, хто завжди мріяв співати, але вважав, що для цього потрібні особливі здібності (спойлер: це не так, потрібен лише хороший викладач, велике бажання та багато практики).`,
    imageFirst: true,
    extraClass: "",
    hasButton: false,
    paddingBottom: "pb-20",
    headingStyle: HEADING_STYLE_THIRD,
  },
];

export const stories = [
  {
    imageSrc: "/ed.jpg",
    imageAlt: "Photo of Ed Sheeran",
    text: "Ед Ширан зараз збирає стадіони, б’є рекорди стрімінгів та «рве» YouTube, але на початку кар’єри британець грав на вулиці. Романтики в цьому було небагато — Ед буквально був бездомним, і протягом майже трьох років жив за рахунок таких виступів.",
  },
  {
    imageSrc: "/billie.jpg",
    imageAlt: "Photo of Billie Eilish",
    text: "Біллі Айліш стала відомою в 13 років, записавши свій перший хіт, буквально сидячи на ліжку в батьківському домі — і її єдиним партнером у світі музики залишається її брат.",
  },
  {
    imageSrc: "/eminem.jpg",
    imageAlt: "Photo of Eminem",
    text: "Емінем. Відомий усьому світу репер народився у бідній родині, мав проблеми з однолітками, приймав участь у постійних бійках, після однієї з них навіть перебував у комі, працював різноробочим, кухарем та офіціантом.",
  },
];