const MasterC = () => {
  return (
    <div className="mb-60 max-w-[1040px] w-full flex flex-col mt-45 mx-auto items-center">
      <p
        className="text-white text-2xl bg-black/60 p-3"
        style={{ textShadow: "0 0px 10px rgba(0, 0, 0, 1)" }}
      >
        Запрошуємо тебе на{" "}
        <span className="text-[#ff00be]">безкоштовний</span> пробний майстер-клас з вокалу.
        Наш формат - це не просто “музичні заняття з репетитором”, а можливість відкрити свою душу та здібності, які далеко заховані за буденними справами та проблемами.
      </p>

      <p
        className="text-white/70 text-lg mt-10 bg-black/60 p-3"
        style={{ textShadow: "0 0px 10px rgba(0, 0, 0, 1)" }}
      >
        Тут ти зможеш на власному досвіді відчути всю свою унікальність та дізнатися, що робить тебе кращим за інших, адже у нас немає ніяких рамок для творчості та у нас кожен може стати героєм своєї історії.
        Заняття триває півтори години. Ти зможеш спробувати унікальні методи та техніки, розроблені нашим викладачем, який є автором власної методики через яку пройшли вже більше 1000 учнів.
        Після заняття ти отримаєш результати, які тебе здивують, і захочеш залишитися з нами ще надовго.
        А ще майстер-клас з вокалу - це чудова можливість провести вечір з цікавими людьми або зі своєю парою, розважитися та відволіктися від буденних справ :)
      </p>
    </div>
  );
};

export default MasterC;