'use client'
import { useState } from 'react';

const MasterC = () => {
  const [selectedTab, setSelectedTab] = useState(1);

  return (
    <div className="mb-45 max-w-[1040px] w-full flex mt-45 flex-col mx-auto items-center bg-black/60 p-10">
      <div className="flex flex-col mb-8">

        {/* <h1 className="text-white inline-block font-extrabold text-4xl text-center mb-5">
          Безкоштовний майстер-клас
        </h1> */}

        <div className="flex justify-center mb-10">
          <div className="inline-flex bg-black p-2">
            <button
              onClick={() => setSelectedTab(2)}
              className={`text-white text-lg font-semibold px-5 py-2 ${selectedTab === 2 ? 'bg-[#ff00be]' : 'bg-transparent'
                }`}
            >
              Запрошуємо на безкоштовний майстер-клас!
            </button>
            <button
              onClick={() => setSelectedTab(3)}
              className={`text-white text-lg font-semibold px-5 py-2 ${selectedTab === 3 ? 'bg-[#ff00be]' : 'bg-transparent'
                }`}
            >
              Як проходить майстер-клас?
            </button>
          </div>
        </div>

        <div className="text-white text-lg">
          {selectedTab === 2 && (
            <div>
              <p className="text-white/70 text-lg" style={{ textShadow: "0 0px 10px rgba(0, 0, 0, 1)" }}>
                Запрошуємо тебе на безкоштовний пробний майстер-клас з вокалу. Наш формат - це не просто “музичні заняття з репетитором”, а можливість відкрити свою душу та здібності, які далеко заховані за буденними справами та проблемами.
                Тут ти зможеш на власному досвіді відчути всю свою унікальність та дізнатися, що робить тебе кращим за інших,
                адже у нас немає ніяких рамок для творчості та у нас кожен може стати героєм своєї історії. Заняття триває півтори
                години. Ти зможеш спробувати унікальні методи та техніки, розроблені нашим викладачем, який є автором власної
                методики через яку пройшли вже більше 1000 учнів. Після заняття ти отримаєш результати, які тебе здивують, і
                захочеш залишитися з нами ще надовго. А ще майстер-клас з вокалу - це чудова можливість провести вечір з цікавими
                людьми або зі своєю парою, розважитися та відволіктися від буденних справ :)
              </p>
            </div>
          )}
          {selectedTab === 3 && (
            <div>
              <p className="text-white/70 text-lg" style={{ textShadow: "0 0px 10px rgba(0, 0, 0, 1)" }}>
                Дві години натхнення, звуку й відкриттів — саме так можна описати наш формат! Ми працюємо в невеликих групах
                (від 1 до 5 учасників), і в цьому є особлива магія. Адже саме в групі поступово зникає страх бути почутим —
                і починає звучати справжній голос.
                🔹 Починаємо зі знайомства — щоб було затишно.
                🔹 Далі – вправи, що допомагають розслабитися й розкритися.
                🔹 Потім – практичні завдання на напрацювання вокальних навичок.
                На завершення кожен учасник обирає улюблену пісню, яку ми розбираємо разом із викладачем.
                І, звісно, співаємо в мікрофон. Чому це працює? Бо ми віримо в вокальну соціалізацію. Можна співати шикарно
                наодинці з викладачем, але так і не наважитись вийти на сцену. А ми створюємо простір, де стає не страшно
                бути собою, коли співаєш.
              </p>
            </div>
          )}
        </div>
      </div>
    </div>
  );
};

export default MasterC;
